
Disassembly of section .text:

00000000 <__vectors>:
__vectors():
   0:	0c 94 83 00 	jmp	0x106	; 0x106 <__ctors_end>
   4:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
   8:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
   c:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  10:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  14:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  18:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  1c:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  20:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  24:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  28:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  2c:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  30:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  34:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  38:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  3c:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  40:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  44:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  48:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  4c:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  50:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  54:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  58:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  5c:	0c 94 ea 01 	jmp	0x3d4	; 0x3d4 <__vector_23>
  60:	0c 94 b4 00 	jmp	0x168	; 0x168 <__bad_interrupt>
  64:	0c 94 5e 02 	jmp	0x4bc	; 0x4bc <__vector_25>

    <ab7>   DW_AT_decl_file   : 0
    <ab8>   DW_AT_decl_line   : 0
    <ab9>   DW_AT_type        : <0x14>
    <abd>   DW_AT_external    : 1
    <abe>   DW_AT_location    : 5 byte block: 3 7b 0 80 0 	(DW_OP_addr: 80007b)
 <1><ac4>: Abbrev Number: 155 (DW_TAG_variable)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x393): DIDR2
    <aca>   DW_AT_decl_file   : 0
    <acb>   DW_AT_decl_line   : 0
    <acc>   DW_AT_type        : <0x14>
    <ad0>   DW_AT_external    : 1
    <ad1>   DW_AT_location    : 5 byte block: 3 7d 0 80 0 	(DW_OP_addr: 80007d)
 <1><ad7>: Abbrev Number: 156 (DW_TAG_variable)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x399): DIDR0
    <add>   DW_AT_decl_file   : 0
    <ade>   DW_AT_decl_line   : 0
    <adf>   DW_AT_type        : <0x14>
    <ae3>   DW_AT_external    : 1
    <ae4>   DW_AT_location    : 5 byte block: 3 7e 0 80 0 	(DW_OP_addr: 80007e)
 <1><aea>: Abbrev Number: 157 (DW_TAG_variable)
    <aec>   DW_AT_name        : (indirect string, offset: 0x39f): SPMCSR
    <af0>   DW_AT_decl_file   : 0
    <af1>   DW_AT_decl_line   : 0
    <af2>   DW_AT_type        : <0x14>
    <af6>   DW_AT_external    : 1
    <af7>   DW_AT_location    : 5 byte block: 3 57 0 80 0 	(DW_OP_addr: 800057)
 <1><afd>: Abbrev Number: 158 (DW_TAG_variable)
    <aff>   DW_AT_name        : (indirect string, offset: 0x3a6): UDR2
    <b03>   DW_AT_decl_file   : 0
    <b04>   DW_AT_decl_line   : 0
    <b05>   DW_AT_type        : <0x14>
    <b09>   DW_AT_external    : 1
    <b0a>   DW_AT_location    : 5 byte block: 3 d6 0 80 0 	(DW_OP_addr: 8000d6)
 <1><b10>: Abbrev Number: 159 (DW_TAG_variable)
    <b12>   DW_AT_name        : (indirect string, offset: 0x3ab): UCSR2A
    <b16>   DW_AT_decl_file   : 0
    <b17>   DW_AT_decl_line   : 0
    <b18>   DW_AT_type        : <0x14>
    <b1c>   DW_AT_external    : 1
    <b1d>   DW_AT_location    : 5 byte block: 3 d0 0 80 0 	(DW_OP_addr: 8000d0)
 <1><b23>: Abbrev Number: 160 (DW_TAG_variable)
    <b25>   DW_AT_name        : (indirect string, offset: 0x3b2): UCSR2B
    <b29>   DW_AT_decl_file   : 0
    <b2a>   DW_AT_decl_line   : 0
    <b2b>   DW_AT_type        : <0x14>
    <b2f>   DW_AT_external    : 1
    <b30>   DW_AT_location    : 5 byte block: 3 d1 0 80 0 	(DW_OP_addr: 8000d1)
 <1><b36>: Abbrev Number: 161 (DW_TAG_variable)
    <b38>   DW_AT_name        : (indirect string, offset: 0x3b9): UCSR2C
    <b3c>   DW_AT_decl_file   : 0
    <b3d>   DW_AT_decl_line   : 0
    <b3e>   DW_AT_type        : <0x14>
    <b42>   DW_AT_external    : 1
    <b43>   DW_AT_location    : 5 byte block: 3 d2 0 80 0 	(DW_OP_addr: 8000d2)
 <1><b49>: Abbrev Number: 162 (DW_TAG_variable)
    <b4b>   DW_AT_name        : (indirect string, offset: 0x3c0): UBRR2
    <b4f>   DW_AT_decl_file   : 0
    <b50>   DW_AT_decl_line   : 0
    <b51>   DW_AT_type        : <0x1b>
    <b55>   DW_AT_external    : 1
    <b56>   DW_AT_location    : 5 byte block: 3 d4 0 80 0 	(DW_OP_addr: 8000d4)
 <1><b5c>: Abbrev Number: 163 (DW_TAG_variable)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x3c6): UDR3
    <b62>   DW_AT_decl_file   : 0
    <b63>   DW_AT_decl_line   : 0
    <b64>   DW_AT_type        : <0x14>
    <b68>   DW_AT_external    : 1
    <b69>   DW_AT_location    : 5 byte block: 3 36 1 80 0 	(DW_OP_addr: 800136)
 <1><b6f>: Abbrev Number: 164 (DW_TAG_variable)
    <b71>   DW_AT_name        : (indirect string, offset: 0x3cb): UCSR3A
    <b75>   DW_AT_decl_file   : 0
    <b76>   DW_AT_decl_line   : 0
    <b77>   DW_AT_type        : <0x14>
    <b7b>   DW_AT_external    : 1
    <b7c>   DW_AT_location    : 5 byte block: 3 30 1 80 0 	(DW_OP_addr: 800130)
 <1><b82>: Abbrev Number: 165 (DW_TAG_variable)
    <b84>   DW_AT_name        : (indirect string, offset: 0x3d2): UCSR3B
    <b88>   DW_AT_decl_file   : 0
    <b89>   DW_AT_decl_line   : 0
    <b8a>   DW_AT_type        : <0x14>
    <b8e>   DW_AT_external    : 1
    <b8f>   DW_AT_location    : 5 byte block: 3 31 1 80 0 	(DW_OP_addr: 800131)
 <1><b95>: Abbrev Number: 166 (DW_TAG_variable)
    <b97>   DW_AT_name        : (indirect string, offset: 0x3d9): UCSR3C
    <b9b>   DW_AT_decl_file   : 0
    <b9c>   DW_AT_decl_line   : 0
    <b9d>   DW_AT_type        : <0x14>
    <ba1>   DW_AT_external    : 1
    <ba2>   DW_AT_location    : 5 byte block: 3 32 1 80 0 	(DW_OP_addr: 800132)
 <1><ba8>: Abbrev Number: 167 (DW_TAG_variable)
    <baa>   DW_AT_name        : (indirect string, offset: 0x3e0): UBRR3
    <bae>   DW_AT_decl_file   : 0
    <baf>   DW_AT_decl_line   : 0
    <bb0>   DW_AT_type        : <0x1b>
    <bb4>   DW_AT_external    : 1
    <bb5>   DW_AT_location    : 5 byte block: 3 34 1 80 0 	(DW_OP_addr: 800134)
 <1><bbb>: Abbrev Number: 0
  Compilation Unit @ offset 0xbbc:
   Length:        0xe70 (32-bit)
   Version:       2
   Abbrev Offset: 0xb1a
   Pointer Size:  4
 <0><bc7>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <bc8>   DW_AT_producer    : (indirect string, offset: 0x5f6): GNU GIMPLE 7.3.0 -mn-flash=4 -mmcu=avr6 -mn-flash=4 -mno-skip-bug -mmcu=avr6 -g -Os -Os -fmath-errno -fsigned-zeros -ftrapping-math -fno-trapv -fno-openmp -fno-openacc -fno-exceptions -fuse-linker-plugin -fltrans
    <bcc>   DW_AT_language    : 2	(non-ANSI C)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x833): <artificial>
    <bd1>   DW_AT_comp_dir    : (indirect string, offset: 0x431): /home/user/EFF/TestPrograms/hello_world
    <bd5>   DW_AT_ranges      : 0x30
    <bd9>   DW_AT_low_pc      : 0x0
    <bdd>   DW_AT_entry_pc    : 0x0
    <be1>   DW_AT_stmt_list   : 0x1a
 <1><be5>: Abbrev Number: 2 (DW_TAG_structure_type)
    <be6>   DW_AT_name        : (indirect string, offset: 0x76b): Print
    <bea>   DW_AT_byte_size   : 4
    <beb>   DW_AT_decl_file   : 7
    <bec>   DW_AT_decl_line   : 37
    <bed>   DW_AT_containing_type: <0xbe5>
    <bf1>   DW_AT_sibling     : <0xcdb>
 <2><bf5>: Abbrev Number: 3 (DW_TAG_member)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x765): _vptr.Print
    <bfa>   DW_AT_type        : <0xced>
    <bfe>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <c01>   DW_AT_artificial  : 1
 <2><c02>: Abbrev Number: 4 (DW_TAG_member)
    <c03>   DW_AT_name        : (indirect string, offset: 0x4ef): write_error
    <c07>   DW_AT_decl_file   : 7
    <c08>   DW_AT_decl_line   : 40
    <c09>   DW_AT_type        : <0xce6>
    <c0d>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
    <c10>   DW_AT_accessibility: 3	(private)
 <2><c11>: Abbrev Number: 5 (DW_TAG_subprogram)
    <c12>   DW_AT_name        : (indirect string, offset: 0x3f8): println
    <c16>   DW_AT_decl_file   : 1
    <c17>   DW_AT_decl_line   : 126
    <c18>   DW_AT_prototyped  : 1
    <c19>   DW_AT_type        : <0x103e>
    <c1d>   DW_AT_declaration : 1
    <c1e>   DW_AT_object_pointer: <0xc26>
    <c22>   DW_AT_sibling     : <0xc2d>
 <3><c26>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c27>   DW_AT_type        : <0x11de>
    <c2b>   DW_AT_artificial  : 1
 <3><c2c>: Abbrev Number: 0
 <2><c2d>: Abbrev Number: 7 (DW_TAG_subprogram)
    <c2e>   DW_AT_name        : (indirect string, offset: 0x5cb): _ZN5Print5writeEPKc.part.2
    <c32>   DW_AT_prototyped  : 1
    <c33>   DW_AT_type        : <0x103e>
    <c37>   DW_AT_artificial  : 1
    <c38>   DW_AT_declaration : 1
    <c39>   DW_AT_object_pointer: <0xc41>
    <c3d>   DW_AT_sibling     : <0xc4d>
 <3><c41>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c42>   DW_AT_type        : <0x11de>
    <c46>   DW_AT_artificial  : 1
 <3><c47>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c48>   DW_AT_type        : <0x1202>
 <3><c4c>: Abbrev Number: 0
 <2><c4d>: Abbrev Number: 5 (DW_TAG_subprogram)
    <c4e>   DW_AT_name        : (indirect string, offset: 0x51f): write
    <c52>   DW_AT_decl_file   : 7
    <c53>   DW_AT_decl_line   : 52
    <c54>   DW_AT_prototyped  : 1
    <c55>   DW_AT_type        : <0x103e>
    <c59>   DW_AT_declaration : 1
    <c5a>   DW_AT_object_pointer: <0xc62>
    <c5e>   DW_AT_sibling     : <0xc6e>
 <3><c62>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c63>   DW_AT_type        : <0x11de>
    <c67>   DW_AT_artificial  : 1
 <3><c68>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c69>   DW_AT_type        : <0x1202>
 <3><c6d>: Abbrev Number: 0
 <2><c6e>: Abbrev Number: 5 (DW_TAG_subprogram)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x3f8): println
    <c73>   DW_AT_decl_file   : 1
    <c74>   DW_AT_decl_line   : 138
    <c75>   DW_AT_prototyped  : 1
    <c76>   DW_AT_type        : <0x103e>
    <c7a>   DW_AT_declaration : 1
    <c7b>   DW_AT_object_pointer: <0xc83>
    <c7f>   DW_AT_sibling     : <0xc8f>
 <3><c83>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c84>   DW_AT_type        : <0x11de>
    <c88>   DW_AT_artificial  : 1
 <3><c89>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <c8a>   DW_AT_type        : <0x1202>
 <3><c8e>: Abbrev Number: 0
 <2><c8f>: Abbrev Number: 9 (DW_TAG_subprogram)
    <c90>   DW_AT_name        : (indirect string, offset: 0x51f): write
    <c94>   DW_AT_decl_file   : 1
    <c95>   DW_AT_decl_line   : 34
    <c96>   DW_AT_prototyped  : 1
    <c97>   DW_AT_type        : <0x103e>
    <c9b>   DW_AT_virtuality  : 1	(virtual)
    <c9c>   DW_AT_vtable_elem_location: 2 byte block: 10 1 	(DW_OP_constu: 1)
    <c9f>   DW_AT_containing_type: <0xbe5>
    <ca3>   DW_AT_declaration : 1
    <ca4>   DW_AT_object_pointer: <0xcac>
    <ca8>   DW_AT_sibling     : <0xcbd>
 <3><cac>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <cad>   DW_AT_type        : <0x11de>
    <cb1>   DW_AT_artificial  : 1
 <3><cb2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cb3>   DW_AT_type        : <0x1289>
 <3><cb7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cb8>   DW_AT_type        : <0x103e>
 <3><cbc>: Abbrev Number: 0
 <2><cbd>: Abbrev Number: 10 (DW_TAG_subprogram)
    <cbe>   DW_AT_name        : (indirect string, offset: 0x519): print
    <cc2>   DW_AT_decl_file   : 1
    <cc3>   DW_AT_decl_line   : 62
    <cc4>   DW_AT_prototyped  : 1
    <cc5>   DW_AT_type        : <0x103e>
    <cc9>   DW_AT_declaration : 1
    <cca>   DW_AT_object_pointer: <0xcce>
 <3><cce>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ccf>   DW_AT_type        : <0x11de>
    <cd3>   DW_AT_artificial  : 1
 <3><cd4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cd5>   DW_AT_type        : <0x1202>
 <3><cd9>: Abbrev Number: 0
 <2><cda>: Abbrev Number: 0
 <1><cdb>: Abbrev Number: 11 (DW_TAG_subroutine_type)
    <cdc>   DW_AT_type        : <0xce6>
    <ce0>   DW_AT_sibling     : <0xce6>
 <2><ce4>: Abbrev Number: 12 (DW_TAG_unspecified_parameters)
 <2><ce5>: Abbrev Number: 0
 <1><ce6>: Abbrev Number: 13 (DW_TAG_base_type)
    <ce7>   DW_AT_byte_size   : 2
    <ce8>   DW_AT_encoding    : 5	(signed)
    <ce9>   DW_AT_name        : int
 <1><ced>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <cee>   DW_AT_byte_size   : 2
    <cef>   DW_AT_type        : <0xcf3>
 <1><cf3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <cf4>   DW_AT_byte_size   : 2
    <cf5>   DW_AT_name        : (indirect string, offset: 0x5e6): __vtbl_ptr_type
    <cf9>   DW_AT_type        : <0xcdb>
 <1><cfd>: Abbrev Number: 2 (DW_TAG_structure_type)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x525): Stream
    <d02>   DW_AT_byte_size   : 12
    <d03>   DW_AT_decl_file   : 8
    <d04>   DW_AT_decl_line   : 49
    <d05>   DW_AT_containing_type: <0xd35>
    <d09>   DW_AT_sibling     : <0xd35>
 <2><d0d>: Abbrev Number: 16 (DW_TAG_inheritance)
    <d0e>   DW_AT_type        : <0xd35>
    <d12>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <d15>   DW_AT_accessibility: 1	(public)
 <2><d16>: Abbrev Number: 4 (DW_TAG_member)
    <d17>   DW_AT_name        : (indirect string, offset: 0x414): _timeout
    <d1b>   DW_AT_decl_file   : 8
    <d1c>   DW_AT_decl_line   : 52
    <d1d>   DW_AT_type        : <0xd3b>
    <d21>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
    <d24>   DW_AT_accessibility: 2	(protected)
 <2><d25>: Abbrev Number: 4 (DW_TAG_member)
    <d26>   DW_AT_name        : (indirect string, offset: 0x6e8): _startMillis
    <d2a>   DW_AT_decl_file   : 8
    <d2b>   DW_AT_decl_line   : 53
    <d2c>   DW_AT_type        : <0xd3b>
    <d30>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <d33>   DW_AT_accessibility: 2	(protected)
 <2><d34>: Abbrev Number: 0
 <1><d35>: Abbrev Number: 17 (DW_TAG_structure_type)
    <d36>   DW_AT_name        : (indirect string, offset: 0x76b): Print
    <d3a>   DW_AT_declaration : 1
 <1><d3b>: Abbrev Number: 18 (DW_TAG_base_type)
    <d3c>   DW_AT_byte_size   : 4
    <d3d>   DW_AT_encoding    : 7	(unsigned)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x4fb): long unsigned int
 <1><d42>: Abbrev Number: 19 (DW_TAG_typedef)
    <d43>   DW_AT_name        : (indirect string, offset: 0x6e0): uint8_t
    <d47>   DW_AT_decl_file   : 10
    <d48>   DW_AT_decl_line   : 126
    <d49>   DW_AT_type        : <0xd57>
 <1><d4d>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <d4e>   DW_AT_type        : <0xd42>
 <1><d52>: Abbrev Number: 21 (DW_TAG_const_type)
    <d53>   DW_AT_type        : <0xd42>
 <1><d57>: Abbrev Number: 18 (DW_TAG_base_type)
    <d58>   DW_AT_byte_size   : 1
    <d59>   DW_AT_encoding    : 8	(unsigned char)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x4dc): unsigned char
 <1><d5e>: Abbrev Number: 19 (DW_TAG_typedef)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x7e7): tx_buffer_index_t
    <d63>   DW_AT_decl_file   : 11
    <d64>   DW_AT_decl_line   : 59
    <d65>   DW_AT_type        : <0xd42>
 <1><d69>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <d6a>   DW_AT_type        : <0xd5e>
 <1><d6e>: Abbrev Number: 19 (DW_TAG_typedef)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x554): rx_buffer_index_t
    <d73>   DW_AT_decl_file   : 11
    <d74>   DW_AT_decl_line   : 64
    <d75>   DW_AT_type        : <0xd42>
 <1><d79>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <d7a>   DW_AT_type        : <0xd6e>
 <1><d7e>: Abbrev Number: 2 (DW_TAG_structure_type)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x8bd): HardwareSerial
    <d83>   DW_AT_byte_size   : 157
    <d84>   DW_AT_decl_file   : 11
    <d85>   DW_AT_decl_line   : 93
    <d86>   DW_AT_containing_type: <0xd35>
    <d8a>   DW_AT_sibling     : <0xfa0>
 <2><d8e>: Abbrev Number: 16 (DW_TAG_inheritance)
    <d8f>   DW_AT_type        : <0xcfd>
    <d93>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <d96>   DW_AT_accessibility: 1	(public)
 <2><d97>: Abbrev Number: 4 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0x8a6): _ubrrh
    <d9c>   DW_AT_decl_file   : 11
    <d9d>   DW_AT_decl_line   : 96
    <d9e>   DW_AT_type        : <0xfa6>
    <da2>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
    <da5>   DW_AT_accessibility: 2	(protected)
 <2><da6>: Abbrev Number: 4 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x595): _ubrrl
    <dab>   DW_AT_decl_file   : 11
    <dac>   DW_AT_decl_line   : 97
    <dad>   DW_AT_type        : <0xfa6>
    <db1>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
    <db4>   DW_AT_accessibility: 2	(protected)
 <2><db5>: Abbrev Number: 4 (DW_TAG_member)
    <db6>   DW_AT_name        : (indirect string, offset: 0x570): _ucsra
    <dba>   DW_AT_decl_file   : 11
    <dbb>   DW_AT_decl_line   : 98
    <dbc>   DW_AT_type        : <0xfa6>
    <dc0>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
    <dc3>   DW_AT_accessibility: 2	(protected)
 <2><dc4>: Abbrev Number: 4 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x577): _ucsrb
    <dc9>   DW_AT_decl_file   : 11
    <dca>   DW_AT_decl_line   : 99
    <dcb>   DW_AT_type        : <0xfa6>
    <dcf>   DW_AT_data_member_location: 2 byte block: 23 12 	(DW_OP_plus_uconst: 18)
    <dd2>   DW_AT_accessibility: 2	(protected)
 <2><dd3>: Abbrev Number: 4 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x57e): _ucsrc
    <dd8>   DW_AT_decl_file   : 11
    <dd9>   DW_AT_decl_line   : 100
    <dda>   DW_AT_type        : <0xfa6>
    <dde>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
    <de1>   DW_AT_accessibility: 2	(protected)
 <2><de2>: Abbrev Number: 4 (DW_TAG_member)
    <de3>   DW_AT_name        : (indirect string, offset: 0x813): _udr
    <de7>   DW_AT_decl_file   : 11
    <de8>   DW_AT_decl_line   : 101
    <de9>   DW_AT_type        : <0xfa6>
    <ded>   DW_AT_data_member_location: 2 byte block: 23 16 	(DW_OP_plus_uconst: 22)
    <df0>   DW_AT_accessibility: 2	(protected)
 <2><df1>: Abbrev Number: 4 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x71a): _written
    <df6>   DW_AT_decl_file   : 11
    <df7>   DW_AT_decl_line   : 103
    <df8>   DW_AT_type        : <0xfab>
    <dfc>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
    <dff>   DW_AT_accessibility: 2	(protected)
 <2><e00>: Abbrev Number: 4 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x585): _rx_buffer_head
    <e05>   DW_AT_decl_file   : 11
    <e06>   DW_AT_decl_line   : 105
    <e07>   DW_AT_type        : <0xd79>
    <e0b>   DW_AT_data_member_location: 2 byte block: 23 19 	(DW_OP_plus_uconst: 25)
    <e0e>   DW_AT_accessibility: 2	(protected)
 <2><e0f>: Abbrev Number: 4 (DW_TAG_member)
    <e10>   DW_AT_name        : (indirect string, offset: 0x4b1): _rx_buffer_tail
    <e14>   DW_AT_decl_file   : 11
    <e15>   DW_AT_decl_line   : 106
    <e16>   DW_AT_type        : <0xd79>
    <e1a>   DW_AT_data_member_location: 2 byte block: 23 1a 	(DW_OP_plus_uconst: 26)
    <e1d>   DW_AT_accessibility: 2	(protected)
 <2><e1e>: Abbrev Number: 4 (DW_TAG_member)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x59c): _tx_buffer_head
    <e23>   DW_AT_decl_file   : 11
    <e24>   DW_AT_decl_line   : 107
    <e25>   DW_AT_type        : <0xd69>
    <e29>   DW_AT_data_member_location: 2 byte block: 23 1b 	(DW_OP_plus_uconst: 27)
    <e2c>   DW_AT_accessibility: 2	(protected)
 <2><e2d>: Abbrev Number: 4 (DW_TAG_member)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x8ad): _tx_buffer_tail
    <e32>   DW_AT_decl_file   : 11
    <e33>   DW_AT_decl_line   : 108
    <e34>   DW_AT_type        : <0xd69>
    <e38>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
    <e3b>   DW_AT_accessibility: 2	(protected)
 <2><e3c>: Abbrev Number: 4 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x549): _rx_buffer
    <e41>   DW_AT_decl_file   : 11
    <e42>   DW_AT_decl_line   : 113
    <e43>   DW_AT_type        : <0xfb2>
    <e47>   DW_AT_data_member_location: 2 byte block: 23 1d 	(DW_OP_plus_uconst: 29)
    <e4a>   DW_AT_accessibility: 2	(protected)
 <2><e4b>: Abbrev Number: 4 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x704): _tx_buffer
    <e50>   DW_AT_decl_file   : 11
    <e51>   DW_AT_decl_line   : 114
    <e52>   DW_AT_type        : <0xfb2>
    <e56>   DW_AT_data_member_location: 2 byte block: 23 5d 	(DW_OP_plus_uconst: 93)
    <e59>   DW_AT_accessibility: 2	(protected)
 <2><e5a>: Abbrev Number: 22 (DW_TAG_subprogram)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x476): begin
    <e5f>   DW_AT_decl_file   : 2
    <e60>   DW_AT_decl_line   : 117
    <e61>   DW_AT_prototyped  : 1
    <e62>   DW_AT_declaration : 1
    <e63>   DW_AT_object_pointer: <0xe6b>
    <e67>   DW_AT_sibling     : <0xe7c>
 <3><e6b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <e6c>   DW_AT_type        : <0x1146>
    <e70>   DW_AT_artificial  : 1
 <3><e71>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e72>   DW_AT_type        : <0xd3b>
 <3><e76>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e77>   DW_AT_type        : <0x1049>
 <3><e7b>: Abbrev Number: 0
 <2><e7c>: Abbrev Number: 9 (DW_TAG_subprogram)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x794): availableForWrite
    <e81>   DW_AT_decl_file   : 2
    <e82>   DW_AT_decl_line   : 192
    <e83>   DW_AT_prototyped  : 1
    <e84>   DW_AT_type        : <0xce6>
    <e88>   DW_AT_virtuality  : 1	(virtual)
    <e89>   DW_AT_vtable_elem_location: 2 byte block: 10 2 	(DW_OP_constu: 2)
    <e8c>   DW_AT_containing_type: <0xd7e>
    <e90>   DW_AT_declaration : 1
    <e91>   DW_AT_object_pointer: <0xe99>
    <e95>   DW_AT_sibling     : <0xea0>
 <3><e99>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <e9a>   DW_AT_type        : <0x1146>
    <e9e>   DW_AT_artificial  : 1
 <3><e9f>: Abbrev Number: 0
 <2><ea0>: Abbrev Number: 9 (DW_TAG_subprogram)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x8cc): read
    <ea5>   DW_AT_decl_file   : 2
    <ea6>   DW_AT_decl_line   : 180
    <ea7>   DW_AT_prototyped  : 1
    <ea8>   DW_AT_type        : <0xce6>
    <eac>   DW_AT_virtuality  : 1	(virtual)
    <ead>   DW_AT_vtable_elem_location: 2 byte block: 10 5 	(DW_OP_constu: 5)
    <eb0>   DW_AT_containing_type: <0xd7e>
    <eb4>   DW_AT_declaration : 1
    <eb5>   DW_AT_object_pointer: <0xebd>
    <eb9>   DW_AT_sibling     : <0xec4>
 <3><ebd>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ebe>   DW_AT_type        : <0x1146>
    <ec2>   DW_AT_artificial  : 1
 <3><ec3>: Abbrev Number: 0
 <2><ec4>: Abbrev Number: 9 (DW_TAG_subprogram)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x514): peek
    <ec9>   DW_AT_decl_file   : 2
    <eca>   DW_AT_decl_line   : 171
    <ecb>   DW_AT_prototyped  : 1
    <ecc>   DW_AT_type        : <0xce6>
    <ed0>   DW_AT_virtuality  : 1	(virtual)
    <ed1>   DW_AT_vtable_elem_location: 2 byte block: 10 6 	(DW_OP_constu: 6)
    <ed4>   DW_AT_containing_type: <0xd7e>
    <ed8>   DW_AT_declaration : 1
    <ed9>   DW_AT_object_pointer: <0xee1>
    <edd>   DW_AT_sibling     : <0xee8>
 <3><ee1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ee2>   DW_AT_type        : <0x1146>
    <ee6>   DW_AT_artificial  : 1
 <3><ee7>: Abbrev Number: 0
 <2><ee8>: Abbrev Number: 9 (DW_TAG_subprogram)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x860): available
    <eed>   DW_AT_decl_file   : 2
    <eee>   DW_AT_decl_line   : 166
    <eef>   DW_AT_prototyped  : 1
    <ef0>   DW_AT_type        : <0xce6>
    <ef4>   DW_AT_virtuality  : 1	(virtual)
    <ef5>   DW_AT_vtable_elem_location: 2 byte block: 10 4 	(DW_OP_constu: 4)
    <ef8>   DW_AT_containing_type: <0xd7e>
    <efc>   DW_AT_declaration : 1
    <efd>   DW_AT_object_pointer: <0xf05>
    <f01>   DW_AT_sibling     : <0xf0c>
 <3><f05>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f06>   DW_AT_type        : <0x1146>
    <f0a>   DW_AT_artificial  : 1
 <3><f0b>: Abbrev Number: 0
 <2><f0c>: Abbrev Number: 23 (DW_TAG_subprogram)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x47c): _ZN14HardwareSerial17_tx_udr_empty_irqEv.part.2
    <f11>   DW_AT_prototyped  : 1
    <f12>   DW_AT_artificial  : 1
    <f13>   DW_AT_declaration : 1
    <f14>   DW_AT_object_pointer: <0xf1c>
    <f18>   DW_AT_sibling     : <0xf23>
 <3><f1c>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f1d>   DW_AT_type        : <0x1146>
    <f21>   DW_AT_artificial  : 1
 <3><f22>: Abbrev Number: 0
 <2><f23>: Abbrev Number: 22 (DW_TAG_subprogram)
    <f24>   DW_AT_name        : (indirect string, offset: 0x7a6): _tx_udr_empty_irq
    <f28>   DW_AT_decl_file   : 2
    <f29>   DW_AT_decl_line   : 89
    <f2a>   DW_AT_prototyped  : 1
    <f2b>   DW_AT_declaration : 1
    <f2c>   DW_AT_object_pointer: <0xf34>
    <f30>   DW_AT_sibling     : <0xf3b>
 <3><f34>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f35>   DW_AT_type        : <0x1146>
    <f39>   DW_AT_artificial  : 1
 <3><f3a>: Abbrev Number: 0
 <2><f3b>: Abbrev Number: 9 (DW_TAG_subprogram)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x51f): write
    <f40>   DW_AT_decl_file   : 2
    <f41>   DW_AT_decl_line   : 225
    <f42>   DW_AT_prototyped  : 1
    <f43>   DW_AT_type        : <0x103e>
    <f47>   DW_AT_virtuality  : 1	(virtual)
    <f48>   DW_AT_vtable_elem_location: 2 byte block: 10 0 	(DW_OP_constu: 0)
    <f4b>   DW_AT_containing_type: <0xd7e>
    <f4f>   DW_AT_declaration : 1
    <f50>   DW_AT_object_pointer: <0xf58>
    <f54>   DW_AT_sibling     : <0xf64>
 <3><f58>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f59>   DW_AT_type        : <0x1146>
    <f5d>   DW_AT_artificial  : 1
 <3><f5e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <f5f>   DW_AT_type        : <0xd42>
 <3><f63>: Abbrev Number: 0
 <2><f64>: Abbrev Number: 24 (DW_TAG_subprogram)
    <f65>   DW_AT_name        : (indirect string, offset: 0x771): _ZN14HardwareSerial5flushEv.part.3
    <f69>   DW_AT_prototyped  : 1
    <f6a>   DW_AT_virtuality  : 1	(virtual)
    <f6b>   DW_AT_vtable_elem_location: 2 byte block: 10 3 	(DW_OP_constu: 3)
    <f6e>   DW_AT_containing_type: <0xd7e>
    <f72>   DW_AT_artificial  : 1
    <f73>   DW_AT_declaration : 1
    <f74>   DW_AT_object_pointer: <0xf7c>
    <f78>   DW_AT_sibling     : <0xf83>
 <3><f7c>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f7d>   DW_AT_type        : <0x1146>
    <f81>   DW_AT_artificial  : 1
 <3><f82>: Abbrev Number: 0
 <2><f83>: Abbrev Number: 25 (DW_TAG_subprogram)
    <f84>   DW_AT_name        : (indirect string, offset: 0x6cb): flush
    <f88>   DW_AT_decl_file   : 2
    <f89>   DW_AT_decl_line   : 205
    <f8a>   DW_AT_prototyped  : 1
    <f8b>   DW_AT_virtuality  : 1	(virtual)
    <f8c>   DW_AT_vtable_elem_location: 2 byte block: 10 3 	(DW_OP_constu: 3)
    <f8f>   DW_AT_containing_type: <0xd7e>
    <f93>   DW_AT_declaration : 1
    <f94>   DW_AT_object_pointer: <0xf98>
 <3><f98>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f99>   DW_AT_type        : <0x1146>
    <f9d>   DW_AT_artificial  : 1
 <3><f9e>: Abbrev Number: 0
 <2><f9f>: Abbrev Number: 0
 <1><fa0>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <fa1>   DW_AT_byte_size   : 2
    <fa2>   DW_AT_type        : <0xd4d>
 <1><fa6>: Abbrev Number: 21 (DW_TAG_const_type)
    <fa7>   DW_AT_type        : <0xfa0>
 <1><fab>: Abbrev Number: 18 (DW_TAG_base_type)
    <fac>   DW_AT_byte_size   : 1
    <fad>   DW_AT_encoding    : 2	(boolean)
    <fae>   DW_AT_name        : (indirect string, offset: 0x42c): bool
 <1><fb2>: Abbrev Number: 26 (DW_TAG_array_type)
    <fb3>   DW_AT_type        : <0xd57>
    <fb7>   DW_AT_sibling     : <0xfc2>
 <2><fbb>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <fbc>   DW_AT_type        : <0xfc2>
    <fc0>   DW_AT_upper_bound : 63
 <2><fc1>: Abbrev Number: 0
 <1><fc2>: Abbrev Number: 18 (DW_TAG_base_type)
    <fc3>   DW_AT_byte_size   : 2
    <fc4>   DW_AT_encoding    : 7	(unsigned)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x500): unsigned int
 <1><fc9>: Abbrev Number: 2 (DW_TAG_structure_type)
    <fca>   DW_AT_name        : (indirect string, offset: 0x525): Stream
    <fce>   DW_AT_byte_size   : 12
    <fcf>   DW_AT_decl_file   : 8
    <fd0>   DW_AT_decl_line   : 49
    <fd1>   DW_AT_containing_type: <0x101a>
    <fd5>   DW_AT_sibling     : <0x101a>
 <2><fd9>: Abbrev Number: 16 (DW_TAG_inheritance)
    <fda>   DW_AT_type        : <0x101a>
    <fde>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <fe1>   DW_AT_accessibility: 1	(public)
 <2><fe2>: Abbrev Number: 4 (DW_TAG_member)
    <fe3>   DW_AT_name        : (indirect string, offset: 0x414): _timeout
    <fe7>   DW_AT_decl_file   : 8
    <fe8>   DW_AT_decl_line   : 52
    <fe9>   DW_AT_type        : <0xd3b>
    <fed>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
    <ff0>   DW_AT_accessibility: 2	(protected)
 <2><ff1>: Abbrev Number: 4 (DW_TAG_member)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x6e8): _startMillis
    <ff6>   DW_AT_decl_file   : 8
    <ff7>   DW_AT_decl_line   : 53
    <ff8>   DW_AT_type        : <0xd3b>
    <ffc>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <fff>   DW_AT_accessibility: 2	(protected)
 <2><1000>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1001>   DW_AT_external    : 1
    <1002>   DW_AT_name        : (indirect string, offset: 0x72f): __base_ctor 
    <1006>   DW_AT_decl_file   : 8
    <1007>   DW_AT_decl_line   : 63
    <1008>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x6f5): _ZN6StreamC2Ev
    <100c>   DW_AT_prototyped  : 1
    <100d>   DW_AT_declaration : 1
    <100e>   DW_AT_object_pointer: <0x1012>
 <3><1012>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1013>   DW_AT_type        : <0x1931>
    <1017>   DW_AT_artificial  : 1
 <3><1018>: Abbrev Number: 0
 <2><1019>: Abbrev Number: 0
 <1><101a>: Abbrev Number: 29 (DW_TAG_structure_type)
    <101b>   DW_AT_name        : (indirect string, offset: 0x76b): Print
    <101f>   DW_AT_declaration : 1
    <1020>   DW_AT_sibling     : <0x103e>
 <2><1024>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1025>   DW_AT_external    : 1
    <1026>   DW_AT_name        : (indirect string, offset: 0x72f): __base_ctor 
    <102a>   DW_AT_decl_file   : 7
    <102b>   DW_AT_decl_line   : 46
    <102c>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x400): _ZN5PrintC2Ev
    <1030>   DW_AT_prototyped  : 1
    <1031>   DW_AT_declaration : 1
    <1032>   DW_AT_object_pointer: <0x1036>
 <3><1036>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1037>   DW_AT_type        : <0x193d>
    <103b>   DW_AT_artificial  : 1
 <3><103c>: Abbrev Number: 0
 <2><103d>: Abbrev Number: 0
 <1><103e>: Abbrev Number: 19 (DW_TAG_typedef)
    <103f>   DW_AT_name        : (indirect string, offset: 0x3f1): size_t
    <1043>   DW_AT_decl_file   : 12
    <1044>   DW_AT_decl_line   : 216
    <1045>   DW_AT_type        : <0xfc2>
 <1><1049>: Abbrev Number: 19 (DW_TAG_typedef)
    <104a>   DW_AT_name        : (indirect string, offset: 0x471): byte
    <104e>   DW_AT_decl_file   : 13
    <104f>   DW_AT_decl_line   : 127
    <1050>   DW_AT_type        : <0xd42>
 <1><1054>: Abbrev Number: 19 (DW_TAG_typedef)
    <1055>   DW_AT_name        : (indirect string, offset: 0x80a): uint16_t
    <1059>   DW_AT_decl_file   : 10
    <105a>   DW_AT_decl_line   : 128
    <105b>   DW_AT_type        : <0xfc2>
 <1><105f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <1060>   DW_AT_name        : (indirect string, offset: 0x8bd): HardwareSerial
    <1064>   DW_AT_declaration : 1
    <1065>   DW_AT_sibling     : <0x10d0>
 <2><1069>: Abbrev Number: 23 (DW_TAG_subprogram)
    <106a>   DW_AT_name        : (indirect string, offset: 0x7b8): _ZN14HardwareSerial16_rx_complete_irqEv.part.0
    <106e>   DW_AT_prototyped  : 1
    <106f>   DW_AT_artificial  : 1
    <1070>   DW_AT_declaration : 1
    <1071>   DW_AT_object_pointer: <0x1079>
    <1075>   DW_AT_sibling     : <0x1080>
 <3><1079>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <107a>   DW_AT_type        : <0x10d0>
    <107e>   DW_AT_artificial  : 1
 <3><107f>: Abbrev Number: 0
 <2><1080>: Abbrev Number: 22 (DW_TAG_subprogram)
    <1081>   DW_AT_name        : (indirect string, offset: 0x7f9): _rx_complete_irq
    <1085>   DW_AT_decl_file   : 9
    <1086>   DW_AT_decl_line   : 101
    <1087>   DW_AT_prototyped  : 1
    <1088>   DW_AT_declaration : 1
    <1089>   DW_AT_object_pointer: <0x1091>
    <108d>   DW_AT_sibling     : <0x1098>
 <3><1091>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1092>   DW_AT_type        : <0x10d0>
    <1096>   DW_AT_artificial  : 1
 <3><1097>: Abbrev Number: 0
 <2><1098>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1099>   DW_AT_external    : 1
    <109a>   DW_AT_name        : (indirect string, offset: 0x72f): __base_ctor 
    <109e>   DW_AT_decl_file   : 9
    <109f>   DW_AT_decl_line   : 87
    <10a0>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x73c): _ZN14HardwareSerialC2EPVhS1_S1_S1_S1_S1_
    <10a4>   DW_AT_prototyped  : 1
    <10a5>   DW_AT_declaration : 1
    <10a6>   DW_AT_object_pointer: <0x10aa>
